# RbsWireCircuitDescription Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RbsWireCircuitDescription Property
ParameterTypeId Class See Also
---
"Circuit Description"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RbsWireCircuitDescription { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RbsWireCircuitDescription As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RbsWireCircuitDescription {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace